import { serviceType } from "../types/Service";

export const servicesList: serviceType[] = [
    {
        id: 1,
        name: "Установка AHD камеры до 3 метров",
        serviceName: "ustanovka-ahd-kamery-do-3-metrov",
        category: "Установка и настройка систем видеонаблюдения",
        price: 2000,
        unit: "шт",
        description: "Профессиональная установка и настройка аналоговой AHD камеры на высоте до 3 метров. Включает крепление, подключение, настройку и тестирование работоспособности."
    },
    {
        id: 2,
        name: "Установка AHD камеры до 5 метров",
        serviceName: "ustanovka-ahd-kamery-do-5-metrov",
        category: "Установка и настройка систем видеонаблюдения",
        price: 2500,
        unit: "шт",
        description: "Профессиональная установка и настройка аналоговой AHD камеры на высоте до 5 метров. Включает крепление, подключение, настройку и тестирование работоспособности."
    },
    {
        id: 3,
        name: "Установка AHD камеры свыше 5 метров",
        serviceName: "ustanovka-ahd-kamery-svyshe-5-metrov",
        category: "Установка и настройка систем видеонаблюдения",
        price: 3500,
        unit: "шт",
        description: "Профессиональная установка и настройка аналоговой AHD камеры на высоте свыше 5 метров. Включает крепление, подключение, настройку и тестирование работоспособности."
    },
    {
        id: 4,
        name: "Сборка коммуникационного шкафа",
        serviceName: "sborka-kommunikacionnogo-shkafa",
        category: "Установка и настройка систем видеонаблюдения",
        price: 1500,
        unit: "шт",
        description: "Профессиональная сборка коммуникационного шкафа для размещения оборудования системы видеонаблюдения. Включает монтаж оборудования, прокладку кабелей, настройку."
    },
    {
        id: 5,
        name: "Установка IP камеры до 3 метров",
        serviceName: "ustanovka-ip-kamery-do-3-metrov",
        category: "Установка и настройка систем видеонаблюдения",
        price: 2500,
        unit: "шт",
        description: "Профессиональная установка и настройка IP камеры на высоте до 3 метров. Включает крепление, подключение к сети, настройку и тестирование работоспособности."
    },
    {
        id: 6,
        name: "Установка IP камеры до 5 метров",
        serviceName: "ustanovka-ip-kamery-do-5-metrov",
        category: "Установка и настройка систем видеонаблюдения",
        price: 3000,
        unit: "шт",
        description: "Профессиональная установка и настройка IP камеры на высоте до 5 метров. Включает крепление, подключение к сети, настройку и тестирование работоспособности."
    },
    {
        id: 7,
        name: "Установка IP камеры свыше 5 метров",
        serviceName: "ustanovka-ip-kamery-svyshe-5-metrov",
        category: "Установка и настройка систем видеонаблюдения",
        price: 4000,
        unit: "шт",
        description: "Профессиональная установка и настройка IP камеры на высоте свыше 5 метров. Включает крепление, подключение к сети, настройку и тестирование работоспособности."
    },
    //1111111111111111111111111111
    {
        id: 8,
        name: "Обслуживание кондиционера",
        serviceName: "obsluzhivanie-kondicionera",
        category: "Монтаж и обслуживание кондиционеров",
        price: 4000,
        unit: "шт",
        description: "Профессиональное обслуживание кондиционера. Включает чистку фильтров, проверку уровня хладагента, диагностику работоспособности всех узлов. Рекомендуется 1 раз в год."
    },
    {
        id: 9,
        name: "Монтаж кондиционера «под ключ»",
        serviceName: "montazh-kondicionera-pod-klyuch",
        category: "Монтаж и обслуживание кондиционеров",
        price: 15000,
        unit: "шт",
        description: "Полный монтаж кондиционера «под ключ». Включает прокладку трассы, штрабление, установку внутреннего и наружного блоков, подключение к электросети, запуск в работу."
    },
    {
        id: 10,
        name: "Монтаж кондиционера на готовую трассу",
        serviceName: "montazh-kondicionera-na-gotovuyu-trassu",
        category: "Монтаж и обслуживание кондиционеров",
        price: 8500,
        unit: "шт",
        description: "Монтаж кондиционера на готовую трассу (магистраль). Включает установку внутреннего и наружного блоков, подключение к электросети, запуск в работу."
    },
    {
        id: 11,
        name: "Штрабление стен",
        serviceName: "shtrablenie-sten",
        category: "Монтаж и обслуживание кондиционеров",
        price: 600,
        unit: "м",
        description: "Штрабление стен для прокладки коммуникаций кондиционера. Включает разметку, штробление, очистку канавок."
    },
    {
        id: 12,
        name: "Прокладка трассы под кондиционер",
        serviceName: "prokladka-trassy-pod-kondicioner",
        category: "Монтаж и обслуживание кондиционеров",
        price: 2000,
        unit: "м",
        description: "Прокладка трассы (магистрали) под кондиционер без штрабления. Включает подготовку трассы, прокладку коммуникаций, фиксацию."
    },
    //222222222222222222222222222222
    {
        id: 13,
        name: "Установка NVR (IP) видеорегистратора 8 каналов",
        serviceName: "ustanovka-nvr-(ip)-videoregistratora-8-kanalov",
        category: "Установка видеорегистраторов",
        price: 3000,
        unit: "шт",
        description: "Профессиональная установка и настройка 8-канального NVR (IP) видеорегистратора. Включает монтаж, подключение камер, настройку записи и удаленного доступа."
    },
    {
        id: 14,
        name: "Установка NVR (IP) видеорегистратора 16 каналов",
        serviceName: "ustanovka-nvr-(ip)-videoregistratora-16-kanalov",
        category: "Установка видеорегистраторов",
        price: 3700,
        unit: "шт",
        description: "Профессиональная установка и настройка 16-канального NVR (IP) видеорегистратора. Включает монтаж, подключение камер, настройку записи и удаленного доступа."
    },
    {
        id: 15,
        name: "Установка NVR (IP) видеорегистратора 32 канала",
        serviceName: "ustanovka-nvr-(ip)-videoregistratora-32-kanala",
        category: "Установка видеорегистраторов",
        price: 4500,
        unit: "шт",
        description: "Профессиональная установка и настройка 32-канального NVR (IP) видеорегистратора. Включает монтаж, подключение камер, настройку записи и удаленного доступа."
    },
    {
        id: 16,
        name: "Установка DVR (AHD) видеорегистратора 4 канала",
        serviceName: "ustanovka-dvr-(ahd)-videoregistratora-4-kanala",
        category: "Установка видеорегистраторов",
        price: 1600,
        unit: "шт",
        description: "Профессиональная установка и настройка 4-канального DVR (AHD) видеорегистратора. Включает монтаж, подключение камер, настройку записи и удаленного доступа."
    },
    {
        id: 17,
        name: "Установка DVR (AHD) видеорегистратора 8 каналов",
        serviceName: "ustanovka-dvr-(ahd)-videoregistratora-8-kanalov",
        category: "Установка видеорегистраторов",
        price: 2200,
        unit: "шт",
        description: "Профессиональная установка и настройка 8-канального DVR (AHD) видеорегистратора. Включает монтаж, подключение камер, настройку записи и удаленного доступа."
    },
    {
        id: 18,
        name: "Установка DVR (AHD) видеорегистратора 16 каналов",
        serviceName: "ustanovka-dvr-(ahd)-videoregistratora-16-kanala",
        category: "Установка видеорегистраторов",
        price: 2800,
        unit: "шт",
        description: "Профессиональная установка и настройка 16-канального DVR (AHD) видеорегистратора. Включает монтаж, подключение камер, настройку записи и удаленного доступа."
    },
    {
        id: 19,
        name: "Установка DVR (AHD) видеорегистратора 32 канала",
        serviceName: "ustanovka-dvr-(ahd)-videoregistratora-32-kanala",
        category: "Установка видеорегистраторов",
        price: 3500,
        unit: "шт",
        description: "Профессиональная установка и настройка 32-канального DVR (AHD) видеорегистратора. Включает монтаж, подключение камер, настройку записи и удаленного доступа."
    },
    //333333333333333333333333
    {
        id: 20,
        name: "Электромонтаж в 1-комнатной квартире",
        serviceName: "elektromontazh-v-1-komnatnoj-kvartire",
        category: "Электромонтажные работы",
        price: 35000,
        unit: "шт",
        description: "Полный электромонтаж под ключ в 1-комнатной квартире. Включает проектирование, штробление, прокладку кабеля, установку розеток и выключателей, сборку электрощита."
    },
    {
        id: 21,
        name: "Электромонтаж в 2-комнатной квартире",
        serviceName: "elektromontazh-v-2-komnatnoj-kvartire",
        category: "Электромонтажные работы",
        price: 50000,
        unit: "шт",
        description: "Полный электромонтаж под ключ в 2-комнатной квартире. Включает проектирование, штробление, прокладку кабеля, установку розеток и выключателей, сборку электрощита."
    },
    {
        id: 22,
        name: "Электромонтаж в 3-комнатной квартире",
        serviceName: "elektromontazh-v-3-komnatnoj-kvartire",
        category: "Электромонтажные работы",
        price: 75000,
        unit: "шт",
        description: "Полный электромонтаж под ключ в 3-комнатной квартире. Включает проектирование, штробление, прокладку кабеля, установку розеток и выключателей, сборку электрощита."
    },
    {
        id: 23,
        name: "Сборка электробокса",
        serviceName: "sborka-elektroboksa",
        category: "Электромонтажные работы",
        price: 5000,
        unit: "шт",
        description: "Профессиональная сборка электробокса (распределительного щита). Включает монтаж автоматов, УЗО, шин, настройку системы защиты."
    },
    {
        id: 24,
        name: "Поиск обрыва / тест кабеля",
        serviceName: "poisk-obryva-test-kabelya",
        category: "Электромонтажные работы",
        price: 2500,
        unit: "шт",
        description: "Диагностика и поиск обрыва в кабеле системы видеонаблюдения с использованием профессионального оборудования. Включает тестирование работоспособности всей линии."
    },
    {
        id: 25,
        name: "Скрытая прокладка кабеля в земле",
        serviceName: "skrytaya-prokladka-kabelya-v-zemle",
        category: "Электромонтажные работы",
        price: 90,
        unit: "м",
        description: "Скрытая прокладка кабеля в земле с использованием защитных труб. Цена от 90₽ за погонный метр.Включает рытье траншеи, укладку труб, монтаж кабеля, засыпку."
    },
    {
        id: 26,
        name: "Прокладка кабеля по воздуху",
        serviceName: "prokladka-kabelya-po-vozduxu",
        category: "Электромонтажные работы",
        price: 80,
        unit: "м",
        description: "Прокладка кабеля по воздуху между зданиями или на открытых участках. Цена от 80₽ за погонный метр. Включает установку кронштейнов, натяжение троса, монтаж кабеля."
    },
    {
        id: 27,
        name: "Прокладка кабеля в гофре",
        serviceName: "prokladka-kabelya-v-gofre",
        category: "Электромонтажные работы",
        price: 30,
        unit: "м",
        description: "Прокладка кабеля в гофре для защиты от механических повреждений и внешних воздействий. Цена от 30₽ за погонный метр. Дополнительная стоимость к базовой прокладке кабеля."
    },
    {
        id: 28,
        name: "Прокладка кабеля UTP до 3 метров",
        serviceName: "prokladka-kabelya-utp-do-3-metrov",
        category: "Электромонтажные работы",
        price: 60,
        unit: "м",
        description: "Прокладка кабеля UTP для систем видеонаблюдения на высоту до 3 метров. Включает подготовку трассы, прокладку кабеля, фиксацию."
    },
    {
        id: 29,
        name: "Прокладка кабеля UTP до 5 метров",
        serviceName: "prokladka-kabelya-utp-do-5-metrov",
        category: "Электромонтажные работы",
        price: 80,
        unit: "м",
        description: "Прокладка кабеля UTP для систем видеонаблюдения на высоту до 5 метров. Включает подготовку трассы, прокладку кабеля, фиксацию."
    },
    {
        id: 30,
        name: "Прокладка кабеля UTP свыше 5 метров",
        serviceName: "prokladka-kabelya-utp-svyshe-5-metrov",
        category: "Электромонтажные работы",
        price: 120,
        unit: "м",
        description: "Прокладка кабеля UTP для систем видеонаблюдения на высоту свыше 5 метров. Включает подготовку трассы, прокладку кабеля, фиксацию."
    },
    //4444444444444444444444
    {
        id: 31,
        name: "Установка 4G Wi FI роутера",
        serviceName: "ustanovka-4g-wi-fi-routera",
        category: "Установка и настройка роутеров",
        price: 1500,
        unit: "шт",
        description: "Профессиональная установка и настройка 4G WIFI роутера для организации удаленного доступа к системе видеонаблюдения."
    },
    //5555555555555555555555555
    {
        id: 32,
        name: "Замена HDD (жесткого диска)",
        serviceName: "zamena-hdd-(zhestkogo-diska)",
        category: "Замена жёсткого диска",
        price: 1500,
        unit: "шт",
        description: "Замена жесткого диска в видеорегистраторе. Включает демонтаж старого диска, установку нового, настройку системы записи."
    },
    //66666666666666666666
    {
        id: 33,
        name: "Подключение сетевого POE коммутатора",
        serviceName: "podklyuchenie-setevogo-poe-kommutatora",
        category: "Подключение POE коммутатора",
        price: 900,
        unit: "шт",
        description: "Профессиональное подключение и настройка сетевого Poe коммутатора для организации питания камер по Ethernet. Включает установку, настройку и тестирование."
    },
];